Aa_flowSwissCheeseIco/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "sphereRegion.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }

    right
    {
        type            zeroGradient;
    }

    outside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
