Aa_flowSwissCheeseIco/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    sphereRegion1
    {
        type searchableSphere;
        centre (0.025 0.025 0.1);
        radius 0.01;
    }
    sphereRegion2
    {
        type searchableSphere;
        centre (0.075 0.025 0.1);
        radius 0.01;
    }
    sphereRegion3
    {
        type searchableSphere;
        centre (0.075 0.075 0.1);
        radius 0.01;
    }
    sphereRegion4
    {
        type searchableSphere;
        centre (0.025 0.075 0.1);
        radius 0.01;
    }
    sphereRegion5
    {
        type searchableSphere;
        centre (0.025 0.025 0.2);
        radius 0.01;
    }
    sphereRegion6
    {
        type searchableSphere;
        centre (0.075 0.025 0.2);
        radius 0.01;
    }
    sphereRegion7
    {
        type searchableSphere;
        centre (0.075 0.075 0.2);
        radius 0.01;
    }
    sphereRegion8
    {
        type searchableSphere;
        centre (0.025 0.075 0.2);
        radius 0.01;
    }
    sphereRegion9
    {
        type searchableSphere;
        centre (0.025 0.025 0.3);
        radius 0.01;
    }
    sphereRegion10
    {
        type searchableSphere;
        centre (0.075 0.025 0.3);
        radius 0.01;
    }
    sphereRegion11
    {
        type searchableSphere;
        centre (0.075 0.075 0.3);
        radius 0.01;
    }
    sphereRegion12
    {
        type searchableSphere;
        centre (0.025 0.075 0.3);
        radius 0.01;
    }
    sphereRegion13
    {
        type searchableSphere;
        centre (0.025 0.025 0.4);
        radius 0.01;
    }
    sphereRegion14
    {
        type searchableSphere;
        centre (0.075 0.025 0.4);
        radius 0.01;
    }
    sphereRegion15
    {
        type searchableSphere;
        centre (0.075 0.075 0.4);
        radius 0.01;
    }
    sphereRegion16
    {
        type searchableSphere;
        centre (0.025 0.075 0.4);
        radius 0.01;
    }
    sphereRegion17
    {
        type searchableSphere;
        centre (0.05 0.05 0.05);
        radius 0.01;
    }
    sphereRegion18
    {
        type searchableSphere;
        centre (0.05 0.05 0.15);
        radius 0.01;
    }
    sphereRegion19
    {
        type searchableSphere;
        centre (0.05 0.05 0.25);
        radius 0.01;
    }
    sphereRegion20
    {
        type searchableSphere;
        centre (0.05 0.05 0.35);
        radius 0.01;
    }
    sphereRegion21
    {
        type searchableSphere;
        centre (0.05 0.05 0.45);
        radius 0.01;
    }
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 100000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 100;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 1;



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (

    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        sphereRegion1 {level (1 1); patchInfo {type wall;} }
        sphereRegion2 {level (1 1); patchInfo {type wall;} }
        sphereRegion3 {level (1 1); patchInfo {type wall;} }
        sphereRegion4 {level (1 1); patchInfo {type wall;} }
        sphereRegion5 {level (1 1); patchInfo {type wall;} }
        sphereRegion6 {level (1 1); patchInfo {type wall;} }
        sphereRegion7 {level (1 1); patchInfo {type wall;} }
        sphereRegion8 {level (1 1); patchInfo {type wall;} }
        sphereRegion9 {level (1 1); patchInfo {type wall;} }
        sphereRegion10 {level (1 1); patchInfo {type wall;} }
        sphereRegion11 {level (1 1); patchInfo {type wall;} }
        sphereRegion12 {level (1 1); patchInfo {type wall;} }
        sphereRegion13 {level (1 1); patchInfo {type wall;} }
        sphereRegion14 {level (1 1); patchInfo {type wall;} }
        sphereRegion15 {level (1 1); patchInfo {type wall;} }
        sphereRegion16 {level (1 1); patchInfo {type wall;} }
        sphereRegion17 {level (1 1); patchInfo {type wall;} }
        sphereRegion18 {level (1 1); patchInfo {type wall;} }
        sphereRegion19 {level (1 1); patchInfo {type wall;} }
        sphereRegion20 {level (1 1); patchInfo {type wall;} }
        sphereRegion21 {level (1 1); patchInfo {type wall;} }
    }

    // Resolve sharp angles on fridges
    resolveFeatureAngle 60;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        sphereRegion1
	{
	    mode outside;
            levels ((1 1));
	}
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (0.0499 0.0499 0.2011);


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 3;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 2.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;


    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric) features by sampling the surface (default=false)
        implicitFeatureSnap true;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        sphereRegion1 {nSurfaceLayers 3;}
        sphereRegion2 {nSurfaceLayers 3;}
        sphereRegion3 {nSurfaceLayers 3;}
        sphereRegion4 {nSurfaceLayers 3;}
        sphereRegion5 {nSurfaceLayers 3;}
        sphereRegion6 {nSurfaceLayers 3;}
        sphereRegion7 {nSurfaceLayers 3;}
        sphereRegion8 {nSurfaceLayers 3;}
        sphereRegion9 {nSurfaceLayers 3;}
        sphereRegion10 {nSurfaceLayers 3;}
        sphereRegion11 {nSurfaceLayers 3;}
        sphereRegion12 {nSurfaceLayers 3;}
        sphereRegion13 {nSurfaceLayers 3;}
        sphereRegion14 {nSurfaceLayers 3;}
        sphereRegion15 {nSurfaceLayers 3;}
        sphereRegion16 {nSurfaceLayers 3;}
        sphereRegion17 {nSurfaceLayers 3;}
        sphereRegion18 {nSurfaceLayers 3;}
        sphereRegion19 {nSurfaceLayers 3;}
        sphereRegion20 {nSurfaceLayers 3;}
        sphereRegion21 {nSurfaceLayers 3;}
    }

    // Expansion factor for layer mesh
    expansionRatio 1.0;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.5;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    minThickness 0.05;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 60;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 16x! 90 degrees corresponds to 130 in 16x.
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- Amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
